app.title=Simple Significance
app.tagline=Enkel, veiledet hypotesetesting.
app.description=Simple Significance er et gratis nettbasert verkt\u00F8y for utforskende hypotesetesting. Det er laget for studenter, l\u00E6rere og alle som er nysgjerrige p\u00E5 enkel dataanalyse. Applikasjonen hjelper deg \u00E5 sammenligne grupper ved hjelp av statistiske signifikanstester - uten at du trenger avanserte forkunnskaper i statistikk.
app.note=Merk: Dette verkt\u00F8yet er ikke ment \u00E5 erstatte profesjonell programvare som SPSS eller R. Resultatene er ikke ment \u00E5 brukes i profesjonell sammenheng, og n\u00F8yaktighet kan ikke garanteres.

form.pairedCheckbox=Disse gruppene er parrede (f.eks. f\u00F8r/etter-m\u00E5linger)
form.pairedNote=Dette valget gjelder kun hvis CSV-filen inneholder n\u00F8yaktig to grupper. Det vil bli ignorert ellers.
form.pairedUserNote=Du har angitt at disse gruppene er parrede.
form.pairedTooManyGroups=Merk: Dette valget ignoreres fordi datasettet inneholder mer enn to grupper.

form.chooseFile=Velg fil
form.noFileChosen=Ingen fil valgt
form.label=Vennligst last opp en CSV-fil med to eller flere kolonner:
form.button=Last opp og analyser
form.startAnalysis=Start analyse

project.parsedData=Prosjektdata
project.title=Prosjekttittel:
project.upload.success=Filen \u00AB{0}\u00BB ble lastet opp.
project.upload.error=Klarte ikke \u00E5 lese den opplastede filen.
project.upload.missing=Ingen fil valgt. Vennligst velg en gyldig CSV-fil.

help.hypothesis.title=Hva er hypotesetesting?
help.hypothesis.description=Hypotesetesting er en metode for \u00E5 finne ut om en observert forskjell i data skyldes reelle forskjeller mellom grupper, eller sannsynligvis bare skyldes tilfeldigheter.<br><br><b>Eksempel:</b> Du vil teste om kaffe p\u00E5virker reaksjonstid. Du ber 30 personer gj\u00F8re en enkel reaksjonstest p\u00E5 nett f\u00F8r og etter en kopp kaffe. Resultatene lagres i en CSV-fil med to kolonner \u2013 \u00ABF\u00F8r kaffe\u00BB og \u00ABEtter kaffe\u00BB \u2013 og lastes opp her. Appen hjelper deg med \u00E5 avgj\u00F8re om forskjellen er statistisk signifikant.<br><br><b>Merk:</b> Statistiske resultater er kun p\u00E5litelige med nok data. Du b\u00F8r ha minst 15 personer i hver gruppe. 30 eller flere anbefales.<br><br><b>Viktig:</b> Dette verkt\u00F8yet kontrollerer ikke for <b>konfunderende variabler</b>. Hvis noe annet enn det du fors\u00F8ker \u00E5 teste er ulikt mellom gruppene, vil det kunne p\u00E5virke resultatene. For eksempel kan det \u00E5 utf\u00F8re en reaksjonstest \u00E8n gang fungere som trening, slik at man gj\u00F8r det bedre andre gang man tar testen, uavhengig av om man har drukket kaffe. 

help.tab.basics=Grunnleggende om hypotesetesting
help.tab.basics.title=Grunnleggende om hypotesetesting
help.tab.basics.description=Hypotesetesting brukes for \u00E5 vurdere om observerte forskjeller mellom grupper sannsynligvis skyldes tilfeldigheter, eller om de gjenspeiler en reell effekt. Man starter alltid med en <b>nullhypotese</b> \u2013 vanligvis at det ikke er noen forskjell mellom gruppene. Deretter brukes en statistisk test for \u00E5 vurdere om det finnes nok grunnlag til \u00E5 forkaste nullhypotesen.<br><br>I statistikk kan to grupper v\u00E6re enten uavhengige eller parrede. <b>Parrede data</b> betyr at hvert datapunkt i \u00E9n gruppe har en direkte motpart i den andre \u2013 for eksempel n\u00E5r de samme personene m\u00E5les f\u00F8r og etter en intervensjon. Enkelte tester, som parret T-test og Wilcoxons rangtest, er laget spesielt for slike tilfeller, og b\u00F8r kun brukes dersom m\u00E5lingene faktisk er relatert.<br><br>Et annet viktig begrep er <b>skjevhet</b> (skewness), som sier noe om hvor symmetrisk fordelingen av dataene dine er. En sterk skjevhet kan gj\u00F8re noen tester mindre p\u00E5litelige, selv om dataene ser normale ut ved f\u00F8rste \u00F8yekast.<br><br>Det er ogs\u00E5 viktig \u00E5 vurdere forutsetningene for testen: om dataene er <b>normalfordelte</b>, og om gruppene har omtrent lik <b>varians</b>. Applikasjonen sjekker dette automatisk og anbefaler passende tester.<br><br>Hvis du vil l\u00E6re mer om hypotesetesting og statistiske analyser, anbefaler vi denne lettfattelige oversikten hos Scribbr:<br><a href=\"https://www.scribbr.com/statistics/\" target=\"_blank\"><b>The Beginner\u2019s Guide to Statistical Analysis &ndash; 5 Steps & Examples</b></a>

help.tests.title=Hvilken statistisk test skal jeg velge?
help.tests.description=En signifikanstest vurderer om en forskjell mellom grupper er s\u00E5 stor at den sannsynligvis ikke skyldes tilfeldigheter. Denne appen tilbyr et lite utvalg av vanlige tester:<br><br><b>T-test:</b> Sammenligner gjennomsnitt mellom to grupper (forutsetter normalfordeling og lik varians).<br><b>Welchs T-test:</b> Som T-test, men for ulik varians.<br><b>Parret T-test:</b> Brukes for parvise m\u00E5linger (f.eks. f\u00F8r/etter).<br><b>Mann-Whitney U:</b> Ikke-parametrisk alternativ n\u00E5r data ikke er normalfordelt.<br><b>Wilcoxon:</b> Ikke-parametrisk test for parvise m\u00E5linger.<br><b>ANOVA:</b> Sammenligner tre eller flere grupper med normalfordeling og lik varians.<br><br><b>Merk:</b> Appen vil anbefale \u00E9n passende test basert p\u00E5 dine data.

help.csv.title=Hvordan skal CSV-filen v\u00E6re formatert?
help.csv.description=En CSV-fil er en enkel tekstfil der verdier skilles med komma. Du kan lage en i et regnearkprogram (som Excel eller LibreOffice Calc) ved \u00E5 legge inn data og velge 'Lagre som...' -> '.csv'.<br><br>Du kan ogs\u00E5 lage en CSV-fil manuelt med Notisblokk eller annen teksteditor. Hver kolonne representerer en gruppe. F\u00F8rste rad kan v\u00E6re prosjekttittel, andre rad gruppenavn.<br><br>Du kan ha mer enn to grupper - appen vil anbefale en passende test basert p\u00E5 antall grupper og datainnhold.<br><br><b>Eksempel p\u00E5 CSV-fil:</b><br><pre>Effekt av mindfulness<br>Kontroll, Eksperiment<br>10,23<br>11,1<br>15,23<br>(osv.)</pre>

analysis.summary.title=Dataoppsummering
analysis.group=Gruppe
analysis.size=Antall
analysis.variance=Varians
analysis.normal=Normalfordelt?
analysis.skewness=Skjevhet
analysis.warning.tooFew=Advarsel: En eller flere grupper har mindre enn 15 datapunkter - signifikanstester kan v\u00E6re up\u00E5litelige.
analysis.warning.lowPower=Merk: En eller flere grupper har mindre enn 30 datapunkter - lav statistisk styrke.
analysis.warning.invalid=Feil: En eller flere grupper har mindre enn 5 datapunkter. Ingen tester kan anbefales med s\u00E5 lite data.
analysis.recommendations.title=Anbefalte tester
analysis.result.title=Analyseresultat
analysis.test.notRecommended=Denne testen er ikke anbefalt basert p\u00E5 dataene.
analysis.test.noRecommended=Ingen anbefalte tester basert p\u00E5 dataene.
analysis.test.noRecommended.warning=Datasettet ditt oppfyller ikke kriteriene for noen av de st\u00F8ttede signifikanstestene. Sjekk gruppest\u00F8rrelse, normalfordeling og varians. Du kan ikke fortsette med testing f\u00F8r minst \u00E9n passende test er tilgjengelig.
analysis.test.multigroupNote=Ved mer enn to grupper er det kun ANOVA som st\u00F8ttes. Denne testen krever normalfordeling og tiln\u00E6rmet lik varians mellom alle grupper.
analysis.test.dataTooSmall=En eller flere grupper har for f\u00E5 datapunkter til \u00E5 kunne gjennomf\u00F8re noen st\u00F8ttede statistiske tester.

analysis.test.result.title=Signifikanstest-rapport
analysis.test.type=Valgt test
analysis.test.pvalue=p-verdi
analysis.test.effectSize=Effektst\u00F8rrelse
analysis.test.significance=Signifikansniv\u00E5er
analysis.group.details=Gruppeinformasjon
analysis.print=Skriv ut rapport
analysis.test.summary=Oppsummering
analysis.test.timestamp=Test gjennomf\u00F8rt

analysis.test.summary.sigAt001=Resultatet er statistisk signifikant (p < 0.001), s\u00E5 vi kan forkaste nullhypotesen.
analysis.test.summary.sigAt01=Resultatet er statistisk signifikant (p < 0.01), s\u00E5 vi kan forkaste nullhypotesen.
analysis.test.summary.sigAt05=Resultatet er statistisk signifikant (p < 0.05), s\u00E5 vi kan forkaste nullhypotesen.
analysis.test.summary.sigAt10=Resultatet er statistisk signifikant (p < 0.10), men kun p\u00E5 et svakt niv\u00E5.
analysis.test.summary.notSig=Resultatet er ikke statistisk signifikant (p \u2265 0.10), s\u00E5 vi kan ikke forkaste nullhypotesen.

testtype.T_TEST=Uavhengig T-test
testtype.WELCH_T_TEST=Welchs T-test
testtype.MANN_WHITNEY=Mann-Whitney U-test
testtype.WILCOXON=Wilcoxon sign-rank test
testtype.PAIRED_T_TEST=Parret T-test
testtype.ANOVA=ANOVA

testreason.T_TEST=For normalfordelte data med lik varians
testreason.WELCH_T_TEST=Brukes ved ulik varians mellom grupper
testreason.MANN_WHITNEY=Brukes n\u00E5r data ikke er normalfordelt
testreason.WILCOXON=Ikke-parametrisk test for parrede m\u00E5linger
testreason.PAIRED_T_TEST=For \u00E5 sammenligne parvise observasjoner med normalfordeling
testreason.ANOVA=Sammenligner 3 eller flere grupper med normalfordeling og lik varians

section.about=Om signifikanstesting
section.upload=Last opp data
tab.hypothesis=Hva er hypotesetesting?
tab.tests=Vanlige signifikanstester
tab.csv=CSV-format

about.link=Om
about.content=<div><h3>Simple Significance</h3><em>Versjon 0.5beta</em><br><br>\u00A9 2025 Christian Bj\u00F8rnsrud<br><br><b>E-post:</b> <a href="mailto:ckb78@icloud.com">ckb78@icloud.com</a><br><b>GitHub:</b> <a href="http://github.com/Bjornsrud" target="_blank">github.com/Bjornsrud</a></div>
